{
  "activities": "Atividades: ",
  "technologies": "Tecnologias: ",
  "work-state": "Presente.",
  "source-code": "Código fonte",
  "view-repo": "Ver repositório",
  "warning": "Aviso!",
  "go-back": "Voltar",
  "navigation-bar": {
    "me": "Eu",
    "about": "Sobre",
    "articles": "Artigos",
    "goals": "Metas",
    "my-arts": "Minhas Artes",
    "cv": "CV",
    "themes": {
      "light": "Claro",
      "dark": "Escuro",
      "halloween": "Halloween",
      "ocean": "Oceano",
      "system": "Sistema"
    }
  },
  "landing-page": {
    "introduction": {
      "title-description": "Engenheiro Informático"
    },
    "presentation": {
      "hello": "Olá!",
      "preview": "Meu nome é Carlos Neto, sou Engenheiro Informático trabalhando principalmente com C# e React. Eu também toco guitarra e pinto quadros como hobby. A seguir tenho uma timeline com as minhas experiências até o momento."
    },
    "experience": {
      "agrosig": {
        "position": "",
        "description": "",
        "technologies": [
          ""
        ]
      },
      "pango-ui": {
        "title": "Pango UI",
        "position": "Contribuidor Ativo",
        "description": "Pango UI é um repositório de componentes inspirado no <shad>shadcn/ui</shad> para Blazor. Ele fornece componentes com design elegante e acessíveis que você pode copiar diretamente para o seu projeto, dando a você total propriedade e controle sobre sua interface de usuário. <pango>Confira o repositório aqui.</pango>"
      },
      "uab": {
        "title": "Engenharia Informática",
        "position": "Estudante",
        "description": "O curso de bacharelado em engenharia de informática da Uab (Universidade Aberta) ensina como projetar, analisar e especificar problemas complexos relacionados a dados. Além de desenvolver aplicações robustas, eficientes e eficazes, também capacita o profissional a demonstrar a habilidade de avaliar e testar implementações, garantindo a qualidade, usabilidade e segurança dos processos."
      },
      "logica-colossal": {
        "position": "Desenvolvedor Full Stack",
        "mayom": {
          "description": "Este projeto é um SaaS de gestão financeira pessoal, feito para ajudar as pessoas a acompanhar e controlar os seus gastos. É multi-tenant, onde cada usuário tem seu próprio banco de dados e os que utilizam de forma gratuita compartilham um banco de dados. Existe para web e para mobile e é uma aplicação com um sistema multimoedas que não existe em outras aplicações. O front-end foi feito com Next.js (React) para web e Expo (React Native) para mobile. O back-end foi feito com .NET Core 10 e MongoDB como banco de dados, utilizando uma arquitetura de microserviços.",
          "technologies": [
            "React",
            "React Native",
            "Next.js",
            "C#",
            ".NET 10",
            "MongoDB",
            "Docker",
            "RabbitMQ"
          ]
        }
      },
      "step": {
        "position": "Desenvolvedor Full Stack",
        "palop": {
          "pedidos-online": {
            "position": "Desenvolvedor front-end",
            "description": "Este projeto foi desenvolvido para lidar com a área de construção em Angola, usamos a build tool Vite.js para Web e React Native para dispositivos móveis, mas também adicionamos o Expo depois de algum tempo. Através desta aplicação é possível consultar o certificado de um prédio, fazer um pedido de requisição desse prédio e consultar seus pedidos e as propriedades que você possui. Este é um projeto monorepo que foi desenvolvido usando yarn workspaces para compartilhar o código entre o projeto web e mobile para tornar o desenvolvimento mais rápido, também usamos o Azure DevOps e o fluxo de trabalho do Git.",
            "technologies": ["React", "Vite.js", "React Native", "Expo", "TypeScript", "Tailwind CSS", "Nativewind"]
          }
        },
        "dgav": {
          "candidaturas": {
            "position": "Desenvolvedor Web",
            "description": "Este projeto foi feito para a gestão e envio de formulários que validam a situação dos animais de um produtor, para desenvolver esta aplicação usamos um ambiente .NET Core 8 full stack construindo a aplicação com Blazor. No back office temos também a gestão de utilizadores dentro da DGAV, que estão separados pelas suas funções. Após o envio do formulário, as informações são validadas por alguém do back office e o processo é concluído. Utilizamos Azure DevOps com o fluxo de trabalho Git para desenvolver o projeto.",
            "technologies": ["C#", ".NET 8", "LINQ", "Blazor", "Razor Pages", "Tailwind CSS", "JavaScript", "SQL Server"]
          },
          "jurista-mobile": {
            "position": "Desenvolvedor Mobile",
            "description": "Aplicação desenvolvida para a área jurídica na DGAV, com o objetivo de lidar com os processos internos, utilizamos React Native para desenvolver a aplicação trabalhando com Azure DevOps, utilizando o fluxo de trabalho com Git, fazendo ramificações de tarefas e PRs quando a tarefa foi feita. A aplicação consome os dados de uma API REST recebendo dados no formato JSON. Na app os gestores podem consultar, aprovar e ver documentos relacionados ao processo e ela tem como objetivo validar esses processos seguindo uma hierarquia, o processo vem de um policial fazendo um formulário sobre algum incidente e termina com a validação de uma multa pela direção da DGAV.",
            "technologies": ["React Native", "TypeScript", "Tailwind CSS", "Nativewind", "Axios"]
          }
        }
      },
      "essa": {
        "position": "Estudante",
        "ninja": {
          "position": "Desenvolvedor Full Stack",
          "description": "No meu último ano no ensino secundário profissional, fiz um estágio pelo Erasmus, um programa europeu que dá ótimas oportunidades para os estudantes. Fui para Berlim, Alemanha e trabalhei em uma empresa chamada NinjaRMM que ao fim do meu estágio mudou o nome para NinjaOne. Trabalhei para a equipa de marketing coletando emails, telefones com Webscrape e APIs. Eles precisavam de um programador, pois tinham por volta de 15 mil oportunidades de negócio por coletar, o que não seria possível ser feito a mão. Na área de marketing, eles não tinham muito conhecimento sobre programação, então tive que encontrar um jeito de fazer o que queriam.",
          "activities": [
            "Criação de assinatura de email com HTML, CSS, JS",
            "Webscrape utilizando Python",
            "Coleta de dados de oportunidade de negócio com APIs utilizando Python"
          ]
        }
      },
      "listo": {
        "position": "Estagiário / Assistente na área de Infraestrutura",
        "description": "Listo S.A é uma empresa brasileira que trabalha com máquinas de pagamento, eu não trabalhei para a equipa de desenvolvimento que constrói o SaaS, trabalhei com a equipa de infraestrutura ajudando com o inventário de equipamentos, problemas e configurações com os computadores.",
        "activities": [
          "Configuração de software para telemóvel",
          "Suporte interno",
          "Organização de inventário",
          "Desenvolvimento de tabelas em Excel utilizando VBA"
        ]
      }
    }
  },
  "about": {
    "description-myself": {
      "title": "Um pouco sobre mim",
      "description": "Sou Desenvolvedor de Software Junior, nascido em 17 de março de 2004, tenho interesse por desenvolvimento de sistemas desde os meus 15 anos, e tenho experiência com as seguintes tecnologias:",
      "knowladge": {
        "front-end": [
          "Conhecimento sobre HTML, CSS e JS <subtle>(médio)</subtle>",
          "Websites responsivos com Next.js <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/ai-saas</link>",
          "chats com IA utilizando Next.js <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/nextjs-ai-chat</link>",
          "Aplicações mobile com React Native ou Expo <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/expo-graphql</link>",
          "Websites com Vite.js e React <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/Bloggy</link>",
          "Desenvolvimento de websites com ASP.NET Core 8.0 utilizando Blazor App e páginas Razor <subtle>(baixo)</subtle>",
          "Desenvolvimento web com ASP.NET utilizando Web Forms <subtle>(muito baixo)</subtle>",
          "Desenvolvimento web com ASP.NET utilizando MVC <subtle>(muito baixo)</subtle>",
          "Experiência com Tailwind CSS <subtle>(médio)</subtle>",
          "Experiência com gestores de pacotes como yarn, pnpm e npm <subtle>(médio)</subtle>",
          "Experiência com projetos monorepo <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/frontend-monorepo-template</link>",
          "Design de projeto com Figma <subtle>(baixo)</subtle>",
          "Experiência com TypeScript <subtle>(médio)</subtle>"
        ],
        "back-end": [
          "REST API com ASP.NET Core <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/full-cycle-show-ticket</link>",
          "GraphQL com ASP.NET Core utilizando Hot Chocolate <subtle>(baixo)</subtle>",
          "Experiência com Entity Framework Core <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/full-cycle-show-ticket</link>",
          "Conhecimento e utilização de .NET LINQ <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/LINQ-Extension-Methods</link>",
          "Conhecimento sobre comandos SQL <subtle>(médio)</subtle>",
          "Experiência com base de dados relacional <subtle>(baixo)</subtle>",
          "Chat de IA com Next.js, OpenAI, Hugging Face Inference e Together AI utilizando Typescript em um projeto Next.js <subtle>(médio)</subtle> - <link>https://github.com/Saraivinha1703/nextjs-ai-chat</link>",
          "Experiência com TypeScript <subtle>(médio)</subtle>"
        ],
        "generic": [
          "Azure DevOps para gestão de projeto <subtle>(baixo)</subtle>",
          "Git para controle de versionamento e desenvolvimento de projeto <subtle>(médio)</subtle>",
          "Experiência com JSON <subtle>(médio)</subtle>"
        ]
      },
      "knowladge-levels": "Níveis de experiência: muito baixo - baixo - médio - alto - muito alto"
    }
  },
  "articles": {
    "see": "Ver Artigo",
    "search": "Pesquisar Artigo",
    "not-found": "Nenhum artigo encontrado para ",
    "software-development": {
      "warning": "Os artigos estão disponíveis apenas em inglês, ao alterar a linguagem do site, todas as palavras irão ser traduzidas com excessão do artigo.",
      "title": "Desenvolvimento de Sistemas",
      "last-update": "Última atualização em: ",
      "description": "Tudo o que eu sei e estudei sobre desenvolvimento de sistemas, o processo de aprendizagem, o que foi feito e os resultados de cada tecnologia estudada e aplicada."
    }
  },
  "goals": {
    "title": "Minhas Metas",
    "description": "Aqui estão algumas metas que estabeleci para mim, coisas que eu gostaria de fazer e que acrescentarão mais conhecimento e habilidadees a mim.",
    "portfolio": {
      "title": "Para este Portfólio",
      "description": [
        "Melhorar a performance do site.",
        "Pesquisa de artigos por letras maiúsculas e minúsculas.",
        "Procurar artigos pelas tags.",
        "Adicionar categorias nos artigos.",
        "Procurar artigos por cada palavra na barra de pesquisa."
      ]
    },
    "me": {
      "title": "Para mim",
      "description": [
        "Desenvolver um jogo 2D.",
        "Desenvolver um jogo 3D.",
        "Desenvolver um SaaS para web e mobile.",
        "Desenvolver um pacote NuGet.",
        "Desenvolver um pacote React.",
        "<done>Desenvolver um chat com uma IA.</done> <link>https://github.com/Saraivinha1703/nextjs-ai-chat</link>",
        "Fazer a licenciatura de engenharia de software."
      ]
    }
  },
  "footer": {
    "contact": "Contatos"
  }
}
